"""
Лабораторная работа № 1 по ЛОИС
Вариант 8 (Построение СКНФ)
Выполнили Демидовец Д.В., Тагиева П.К.
Дата выполнения 25.05.2024

Файл с используемыми в работе константами
"""

LAST = -1
ZERO = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
ONE = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
PRIORITY = {1: ["("], 2: ["\\", "!"], 3: ["/"],  4: ["~"], 5: [">"]}
abc = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

# определение множества допустимых переменных и операторов
variables = set('ABCDEFGHIJKLMNOPQRSTUVWXYZ01')
unary_operators = set('!')
binary_operators = {'/\\', '\/', '->', '~'} 
operators = unary_operators | {'/\\', '\/', '~', "->"}  # формируем полный массив операций
parenthesis = set('()')
